Repository: Shugyla0077/lost_and_found_front
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

# appTitle
source: Lost & Found
kk: Табылған заттар
ru: Бюро находок

source: Home
kk: Басты бет
ru: Главная

source: Chats
kk: Чаттар
ru: Чаты

source: My Items
kk: Менің заттарым
ru: Мои вещи

source: Profile
kk: Профиль
ru: Профиль

source: Login
kk: Кіру
ru: Вход

source: Register
kk: Тіркелу
ru: Регистрация

source: Password
kk: Құпиясөз
ru: Пароль

# loginFailed
source: Login failed: {error}
kk: Кіру сәтсіз болды: {error}
ru: Не удалось войти: {error}

# registrationFailed
source: Registration failed: {error}
kk: Тіркелу сәтсіз болды: {error}
ru: Не удалось зарегистрироваться: {error}

# noAccountRegister
source: Don't have an account? Register here
kk: Аккаунт жоқ па? Тіркеліңіз
ru: Нет аккаунта? Зарегистрируйтесь

source: Forgot password?
kk: Құпиясөзді ұмыттыңыз ба?

source: Reset password
kk: Құпиясөзді қалпына келтіру

# resetPasswordHint
source: Enter your email and weâ€™ll send a reset link.
kk: Email енгізіңіз — біз қалпына келтіру сілтемесін жібереміз.

# sendResetLink
source: Send link
kk: Сілтемені жіберу

# emailRequired
source: Email is required
kk: Email міндетті

# passwordResetEmailSent
source: Reset email sent. Check your inbox.
kk: Қалпына келтіру хаты жіберілді. Поштаны тексеріңіз.

# passwordResetFailed
source: Failed to send reset email: {error}
kk: Хатты жіберу мүмкін болмады: {error}

source: Add Item
kk: Зат қосу
ru: Добавить вещь

source: Title
kk: Атауы
ru: Название

source: Description
kk: Сипаттама
ru: Описание

source: Location
kk: Орны
ru: Место

# addItemFailed
source: Failed to add item: {error}
kk: Затты қосу мүмкін болмады: {error}
ru: Не удалось добавить вещь: {error}

# contactPrivateAddItemHint
source: Your contact will remain private. Owners can contact you through chat after claiming.
kk: Байланыс деректеріңіз құпия сақталады. Иесі өтініш жібергеннен кейін чат арқылы хабарласа алады.
ru: Ваши контакты останутся скрытыми. Владелец сможет связаться с вами через чат после заявки.

# noItemsYet
source: No items yet. Add the first one!
kk: Әзірге заттар жоқ. Біріншісін қосыңыз!
ru: Пока нет вещей. Добавьте первую!

# noMyItemsYetTitle
source: No items yet
kk: Заттар жоқ
ru: Нет вещей

# noMyItemsYetSubtitle
source: Add your first found item
kk: Бірінші табылған затыңызды қосыңыз
ru: Добавьте свою первую найденную вещь

# failedToLoadItems
source: Failed to load items: {error}
kk: Заттарды жүктеу мүмкін болмады: {error}
ru: Не удалось загрузить вещи: {error}

source: Claimed
kk: Алынды
ru: Забрано

source: Available
kk: Қолжетімді
ru: Доступно

source: Waiting for owner
kk: Иесін күтіп тұр
ru: Ожидает владельца

# contactsPrivate
source: Contacts are kept private. Use chat to communicate.
kk: Байланыс деректері жасырылған. Хабарласу үшін чатты пайдаланыңыз.
ru: Контакты скрыты. Используйте чат для общения.

# claimYourItemHint
source: Is this your item? Claim it to start chatting with the finder.
kk: Бұл сіздің затыңыз ба? Табушыға жазу үшін өтініш жіберіңіз.
ru: Это ваша вещь? Отправьте заявку, чтобы начать чат с нашедшим.

source: Claim this item
kk: Өтініш жіберу
ru: Отправить заявку

source: Open Chat
kk: Чатты ашу
ru: Открыть чат

source: Already claimed
kk: Бұрын алынған
ru: Уже забрано

# ownItemBanner
source: This item was added by you
kk: Бұл затты сіз қостыңыз
ru: Этот предмет вы добавили

# cannotClaimOwnItem
source: You can't claim your own item.
kk: Өзіңіздің затыңызға өтініш жіберуге болмайды.
ru: Нельзя отправить заявку на свой предмет.

# itemClaimed
source: Item claimed! You can now chat with the finder.
kk: Өтініш жіберілді! Енді чатта жаза аласыз.
ru: Заявка отправлена! Теперь можно писать в чат.

# failedToClaim
source: Failed to claim: {error}
kk: Өтініш жіберу мүмкін болмады: {error}
ru: Не удалось отправить заявку: {error}

# failedToLoadChats
source: Failed to load chats: {error}
kk: Чаттарды жүктеу мүмкін болмады: {error}
ru: Не удалось загрузить чаты: {error}

source: No chats yet
kk: Әзірге чат жоқ
ru: Чатов пока нет

# claimItemToStartChatting
source: Claim an item to start chatting
kk: Чат бастау үшін затқа өтініш жіберіңіз
ru: Отправьте заявку на вещь, чтобы начать чат

# failedToLoadMessages
source: Failed to load messages: {error}
kk: Хабарламаларды жүктеу мүмкін болмады: {error}
ru: Не удалось загрузить сообщения: {error}

# failedToSendMessage
source: Failed to send message: {error}
kk: Хабарлама жіберу мүмкін болмады: {error}
ru: Не удалось отправить сообщение: {error}

# noMessagesYet
source: No messages yet. Start the conversation!
kk: Хабарламалар жоқ. Диалогты бастаңыз!
ru: Сообщений пока нет. Начните диалог!

# noMessagesYetShort
source: No messages yet
kk: Хабарлама жоқ
ru: Сообщений нет

# typeMessageHint
source: Type a message...
kk: Хабарлама жазыңыз...
ru: Введите сообщение...

# timeDaysAgo
source: {days}d ago
kk: {days} күн бұрын
ru: {days}д назад

# timeHoursAgo
source: {hours}h ago
kk: {hours} сағ бұрын
ru: {hours}ч назад

# timeMinutesAgo
source: {minutes}m ago
kk: {minutes} мин бұрын
ru: {minutes}м назад

# timeJustNow
source: Just now
kk: Қазір ғана
ru: Только что

source: Profile saved
kk: Профиль сақталды
ru: Профиль сохранён

# notAuthenticated
source: Not authenticated. Please sign in.
kk: Авторизация жоқ. Қайта кіріңіз.
ru: Вы не авторизованы. Пожалуйста, войдите.

# failedToLoadProfile
source: Failed to load profile: {error}
kk: Профильді жүктеу мүмкін болмады: {error}
ru: Не удалось загрузить профиль: {error}

# failedToSaveProfile
source: Failed to save profile: {error}
kk: Профильді сақтау мүмкін болмады: {error}
ru: Не удалось сохранить профиль: {error}

source: Account
kk: Аккаунт
ru: Аккаунт

# profileSection
source: Profile
kk: Профиль
ru: Профиль

source: Display name
kk: Аты
ru: Имя

source: City
kk: Қала
ru: Город

source: About
kk: Өзі туралы
ru: О себе

source: Save
kk: Сақтау
ru: Сохранить

source: Edit
kk: Өзгерту

source: Cancel
kk: Бас тарту

source: Logout
kk: Шығу
ru: Выйти

source: Language
kk: Тіл
ru: Язык

source: English
kk: Ағылшын
ru: Английский

source: Russian
kk: Орысша
ru: Русский

source: Kazakh
kk: Қазақша
ru: Казахский

source: Category
kk: Санат

source: Filters
kk: Сүзгілер

# resetFilters
source: Reset
kk: Тазалау

# applyFilters
source: Apply
kk: Қолдану

source: Clear
kk: Тазарту

source: All categories
kk: Барлық санаттар

# dateFrom
source: From
kk: Бастап

# dateTo
source: To
kk: Дейін

# noItemsMatchFilter
source: No items match your filters
kk: Сүзгіге сәйкес заттар жоқ

# titleRequired
source: Title is required
kk: Атауы міндетті

source: Claimed items
kk: Алынған заттар

# viewClaimedItems
source: View your claimed items list
kk: Алынған заттар тізімін ашу

source: No claimed items yet
kk: Әзірге алынған заттар жоқ

# failedToLoadClaimedItems
source: Failed to load claimed items: {error}
kk: Алынған заттарды жүктеу мүмкін болмады: {error}

source: Reward payment
kk: Сыйақы төлеу

# rewardPaymentSubtitle
source: Open Stripe Checkout to pay a reward
kk: Төлеу үшін Stripe Checkout ашу

source: Choose amount
kk: Соманы таңдаңыз

source: Custom amount (USD)
kk: Өз сомаңыз (USD)

source: Pay
kk: Төлеу

# invalidAmount
source: Enter a valid amount
kk: Дұрыс соманы енгізіңіз

# amountRange
source: Allowed range: {min}..{max} USD
kk: Рұқсат етілгені: {min}..{max} USD

# failedToOpenCheckout
source: Failed to open Stripe Checkout
kk: Stripe Checkout ашу мүмкін болмады

# paymentFailed
source: Payment failed: {error}
kk: Төлем қатесі: {error}

# paymentThanks
source: Thanks for your payment!
kk: Төлеміңізге рақмет!

source: Payment canceled
kk: Төлем тоқтатылды
